project-chip/connectedhomeip/examples/lighting-app/esp32/sdkconfig.defaults.esp32c6_tee
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_tee.csv"

# ESP-TEE
CONFIG_SECURE_ENABLE_TEE=y
CONFIG_MBEDTLS_TEE_SEC_STG_ECDSA_SIGN=y
CONFIG_SECURE_TEE_SEC_STG_MODE_DEVELOPMENT=y

# DAC via TEE secure storage
CONFIG_SEC_CERT_DAC_PROVIDER=y
CONFIG_USE_ESP32_TEE_SECURE_STORAGE=y
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n

CONFIG_ENABLE_ESP32_FACTORY_DATA_PROVIDER=y
CONFIG_ENABLE_ESP32_DEVICE_INSTANCE_INFO_PROVIDER=y
CONFIG_DEVICE_VENDOR_ID=0xFFF2
CONFIG_DEVICE_PRODUCT_ID=0x8001
CONFIG_CHIP_FACTORY_NAMESPACE_PARTITION_LABEL="fctry"
